-- 1から5の整数で三角形をつくれる3つ組をすべて求めよ
-- Prelude> [ (x, y, z) | x <- [1..5], y <- [1..5], z <- [1..5] ]
-- [ (x, y, z) | x <- [1..5], y <- [1..5], z <- [1..5], x + y > z && x + z > y && y + z > x]

-- 上記で順番をいれかえたものを同じと考える版を作成せよ
-- [ (x, y, z) | x <- [1..5], y <- [1..5], z <- [1..5], x + y > z && x + z > y && y + z > x && x >= y && y >= z ]

main = do
  print $ [ (x, y, z) | x <- [1..5], y <- [1..5], z <- [1..5], x + y > z && x + z > y && y + z > x]
  print $ [ (x, y, z) | x <- [1..5], y <- [1..5], z <- [1..5], x + y > z && x + z > y && y + z > x && x >= y && y >= z ]
